app/controllers/api/categories_controller.rb

SELECT "categories".* FROM "categories"
---
    def index
        @categories = Category.all

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def find_category
        @category = Category.find(params[:id])