app/controllers/api/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."category_id" = ? AND "products"."id" = ? LIMIT ?  [["category_id", 2], ["id", nil], ["LIMIT", 1]]
---
    def show
        get_category
        @products = @category.products.find_by(id: params[:id])

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def get_category
        @category = Category.find(params[:category_id])